# MeganewtonsPerSquareMeter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..MeganewtonsPerSquareMeter Property
UnitTypeId Class See Also
---
Meganewtons per square meter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId MeganewtonsPerSquareMeter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MeganewtonsPerSquareMeter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MeganewtonsPerSquareMeter {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace